[Killed] BlockStatement
src/state-machines/finite-state-machine.ts:31:35
 
 export function createStateMachine<S extends string>(def: FsmDefinition<S>): FiniteStateMachine<S> {
   // Exhaustiveness: every declared state must have a transitions entry.
-  for (const state of def.states) {
-    if (!def.transitions.has(state)) {
-      throw new Error("createStateMachine: state '" + state + "' missing from transitions map");
-    }
-  }
+  for (const state of def.states) {}
   // Reachability: every transition target must be a declared state.
   for (const [from, targets] of def.transitions) {
killedBy: @fleet/domain - createStateMachine validation throws when a declared state is missing from transitions
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/state-machines/finite-state-machine.ts:32:38
 export function createStateMachine<S extends string>(def: FsmDefinition<S>): FiniteStateMachine<S> {
   // Exhaustiveness: every declared state must have a transitions entry.
   for (const state of def.states) {
-    if (!def.transitions.has(state)) {
-      throw new Error("createStateMachine: state '" + state + "' missing from transitions map");
-    }
+    if (!def.transitions.has(state)) {}
   }
   // Reachability: every transition target must be a declared state.
killedBy: @fleet/domain - createStateMachine validation throws when a declared state is missing from transitions
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/state-machines/finite-state-machine.ts:32:9
 export function createStateMachine<S extends string>(def: FsmDefinition<S>): FiniteStateMachine<S> {
   // Exhaustiveness: every declared state must have a transitions entry.
   for (const state of def.states) {
-    if (!def.transitions.has(state)) {
+    if (false) {
       throw new Error("createStateMachine: state '" + state + "' missing from transitions map");
     }
killedBy: @fleet/domain - createStateMachine validation throws when a declared state is missing from transitions
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/state-machines/finite-state-machine.ts:33:63
   // Exhaustiveness: every declared state must have a transitions entry.
   for (const state of def.states) {
     if (!def.transitions.has(state)) {
-      throw new Error("createStateMachine: state '" + state + "' missing from transitions map");
+      throw new Error("createStateMachine: state '" + state + "");
     }
   }
killedBy: @fleet/domain - createStateMachine validation throws when a declared state is missing from transitions
statusReason: expected [Function] to throw error matching /state 'b' missing/ but got 'createStateMachine: state \'b'

[Killed] BlockStatement
src/state-machines/finite-state-machine.ts:37:50
     }
   }
   // Reachability: every transition target must be a declared state.
-  for (const [from, targets] of def.transitions) {
-    for (const target of targets) {
-      if (!def.states.includes(target)) {
-        throw new Error(
-          "createStateMachine: transition " + from + " -> " + target + " references undeclared state",
-        );
-      }
-    }
-  }
+  for (const [from, targets] of def.transitions) {}
   // Terminal states must have empty transition set.
   for (const t of def.terminal) {
killedBy: @fleet/domain - createStateMachine validation throws when a transition targets an undeclared state
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/state-machines/finite-state-machine.ts:38:35
   }
   // Reachability: every transition target must be a declared state.
   for (const [from, targets] of def.transitions) {
-    for (const target of targets) {
-      if (!def.states.includes(target)) {
-        throw new Error(
-          "createStateMachine: transition " + from + " -> " + target + " references undeclared state",
-        );
-      }
-    }
+    for (const target of targets) {}
   }
   // Terminal states must have empty transition set.
killedBy: @fleet/domain - createStateMachine validation throws when a transition targets an undeclared state
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/state-machines/finite-state-machine.ts:39:41
   // Reachability: every transition target must be a declared state.
   for (const [from, targets] of def.transitions) {
     for (const target of targets) {
-      if (!def.states.includes(target)) {
-        throw new Error(
-          "createStateMachine: transition " + from + " -> " + target + " references undeclared state",
-        );
-      }
+      if (!def.states.includes(target)) {}
     }
   }
killedBy: @fleet/domain - createStateMachine validation throws when a transition targets an undeclared state
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/state-machines/finite-state-machine.ts:39:11
   // Reachability: every transition target must be a declared state.
   for (const [from, targets] of def.transitions) {
     for (const target of targets) {
-      if (!def.states.includes(target)) {
+      if (false) {
         throw new Error(
           "createStateMachine: transition " + from + " -> " + target + " references undeclared state",
killedBy: @fleet/domain - createStateMachine validation throws when a transition targets an undeclared state
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/state-machines/finite-state-machine.ts:41:72
     for (const target of targets) {
       if (!def.states.includes(target)) {
         throw new Error(
-          "createStateMachine: transition " + from + " -> " + target + " references undeclared state",
+          "createStateMachine: transition " + from + " -> " + target + "",
         );
       }
killedBy: @fleet/domain - createStateMachine validation throws when a transition targets an undeclared state
statusReason: expected [Function] to throw error matching /references undeclared state/ but got 'createStateMachine: transition a -> g…'

[Survived] StringLiteral
src/state-machines/finite-state-machine.ts:41:54
     for (const target of targets) {
       if (!def.states.includes(target)) {
         throw new Error(
-          "createStateMachine: transition " + from + " -> " + target + " references undeclared state",
+          "createStateMachine: transition " + from + "" + target + " references undeclared state",
         );
       }

[Killed] BlockStatement
src/state-machines/finite-state-machine.ts:47:33
     }
   }
   // Terminal states must have empty transition set.
-  for (const t of def.terminal) {
-    const targets = def.transitions.get(t);
-    if (targets && targets.size > 0) {
-      throw new Error("createStateMachine: terminal state '" + t + "' must have no outgoing transitions");
-    }
-  }
+  for (const t of def.terminal) {}
 
   const terminalSet: ReadonlySet<S> = new Set(def.terminal);
killedBy: @fleet/domain - createStateMachine validation throws when a terminal state has outgoing transitions
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/state-machines/finite-state-machine.ts:49:38
   // Terminal states must have empty transition set.
   for (const t of def.terminal) {
     const targets = def.transitions.get(t);
-    if (targets && targets.size > 0) {
-      throw new Error("createStateMachine: terminal state '" + t + "' must have no outgoing transitions");
-    }
+    if (targets && targets.size > 0) {}
   }
 
killedBy: @fleet/domain - createStateMachine validation throws when a terminal state has outgoing transitions
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/state-machines/finite-state-machine.ts:49:9
   // Terminal states must have empty transition set.
   for (const t of def.terminal) {
     const targets = def.transitions.get(t);
-    if (targets && targets.size > 0) {
+    if (false) {
       throw new Error("createStateMachine: terminal state '" + t + "' must have no outgoing transitions");
     }
killedBy: @fleet/domain - createStateMachine validation throws when a terminal state has outgoing transitions
statusReason: expected [Function] to throw an error

[Killed] ArrowFunction
src/state-machines/finite-state-machine.ts:56:22
 
   const terminalSet: ReadonlySet<S> = new Set(def.terminal);
 
-  const isTerminal = (state: S): boolean => terminalSet.has(state);
+  const isTerminal = () => undefined;
 
   const canTransition = (from: S, to: S): boolean => def.transitions.get(from)?.has(to) ?? false;
killedBy: @fleet/domain - transport order canTransition completed and cancelled are terminal
statusReason: expected undefined to be true // Object.is equality

[Killed] LogicalOperator
src/state-machines/finite-state-machine.ts:58:54
 
   const isTerminal = (state: S): boolean => terminalSet.has(state);
 
-  const canTransition = (from: S, to: S): boolean => def.transitions.get(from)?.has(to) ?? false;
+  const canTransition = (from: S, to: S): boolean => def.transitions.get(from)?.has(to) && false;
 
   const transition = (from: S, to: S): TransitionResult<S> => {
killedBy: @fleet/domain - transport order canTransition allows draft -> assigned and draft -> cancelled
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/state-machines/finite-state-machine.ts:58:25
 
   const isTerminal = (state: S): boolean => terminalSet.has(state);
 
-  const canTransition = (from: S, to: S): boolean => def.transitions.get(from)?.has(to) ?? false;
+  const canTransition = () => undefined;
 
   const transition = (from: S, to: S): TransitionResult<S> => {
killedBy: @fleet/domain - transport order canTransition allows draft -> assigned and draft -> cancelled
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/state-machines/finite-state-machine.ts:60:63
 
   const canTransition = (from: S, to: S): boolean => def.transitions.get(from)?.has(to) ?? false;
 
-  const transition = (from: S, to: S): TransitionResult<S> => {
-    if (from === to) {
-      return { allowed: false, reason: 'SAME_STATE', attemptedFrom: from, attemptedTo: to };
-    }
-    if (isTerminal(from)) {
-      return { allowed: false, reason: 'TERMINAL_STATE', attemptedFrom: from, attemptedTo: to };
-    }
-    if (!canTransition(from, to)) {
-      return { allowed: false, reason: 'INVALID_TRANSITION', attemptedFrom: from, attemptedTo: to };
-    }
-    return { allowed: true, nextState: to };
-  };
+  const transition = (from: S, to: S): TransitionResult<S> => {};
 
   return { version: def.version, states: def.states, isTerminal, canTransition, transition };
killedBy: @fleet/domain - transitionTransportOrder (Result type) returns allowed=true with nextState on valid transition
statusReason: Cannot read properties of undefined (reading 'allowed')

[Killed] ConditionalExpression
src/state-machines/finite-state-machine.ts:61:9
   const canTransition = (from: S, to: S): boolean => def.transitions.get(from)?.has(to) ?? false;
 
   const transition = (from: S, to: S): TransitionResult<S> => {
-    if (from === to) {
+    if (false) {
       return { allowed: false, reason: 'SAME_STATE', attemptedFrom: from, attemptedTo: to };
     }
killedBy: @fleet/domain - transitionTransportOrder (Result type) returns SAME_STATE for self-transition
statusReason: expected 'INVALID_TRANSITION' to be 'SAME_STATE' // Object.is equality

[Killed] EqualityOperator
src/state-machines/finite-state-machine.ts:61:9
   const canTransition = (from: S, to: S): boolean => def.transitions.get(from)?.has(to) ?? false;
 
   const transition = (from: S, to: S): TransitionResult<S> => {
-    if (from === to) {
+    if (from !== to) {
       return { allowed: false, reason: 'SAME_STATE', attemptedFrom: from, attemptedTo: to };
     }
killedBy: @fleet/domain - transitionTransportOrder (Result type) returns allowed=true with nextState on valid transition
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/state-machines/finite-state-machine.ts:62:25
 
   const transition = (from: S, to: S): TransitionResult<S> => {
     if (from === to) {
-      return { allowed: false, reason: 'SAME_STATE', attemptedFrom: from, attemptedTo: to };
+      return { allowed: true, reason: 'SAME_STATE', attemptedFrom: from, attemptedTo: to };
     }
     if (isTerminal(from)) {
killedBy: @fleet/domain - transitionTransportOrder (Result type) returns SAME_STATE for self-transition
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/state-machines/finite-state-machine.ts:62:14
 
   const transition = (from: S, to: S): TransitionResult<S> => {
     if (from === to) {
-      return { allowed: false, reason: 'SAME_STATE', attemptedFrom: from, attemptedTo: to };
+      return {};
     }
     if (isTerminal(from)) {
killedBy: @fleet/domain - transitionTransportOrder (Result type) returns SAME_STATE for self-transition
statusReason: expected undefined to be false // Object.is equality

[Killed] ConditionalExpression
src/state-machines/finite-state-machine.ts:64:9
     if (from === to) {
       return { allowed: false, reason: 'SAME_STATE', attemptedFrom: from, attemptedTo: to };
     }
-    if (isTerminal(from)) {
+    if (true) {
       return { allowed: false, reason: 'TERMINAL_STATE', attemptedFrom: from, attemptedTo: to };
     }
killedBy: @fleet/domain - transitionTransportOrder (Result type) returns allowed=true with nextState on valid transition
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/state-machines/finite-state-machine.ts:64:9
     if (from === to) {
       return { allowed: false, reason: 'SAME_STATE', attemptedFrom: from, attemptedTo: to };
     }
-    if (isTerminal(from)) {
+    if (false) {
       return { allowed: false, reason: 'TERMINAL_STATE', attemptedFrom: from, attemptedTo: to };
     }
killedBy: @fleet/domain - transitionTransportOrder (Result type) returns TERMINAL_STATE when starting from completed
statusReason: expected 'INVALID_TRANSITION' to be 'TERMINAL_STATE' // Object.is equality

[Killed] BooleanLiteral
src/state-machines/finite-state-machine.ts:65:25
       return { allowed: false, reason: 'SAME_STATE', attemptedFrom: from, attemptedTo: to };
     }
     if (isTerminal(from)) {
-      return { allowed: false, reason: 'TERMINAL_STATE', attemptedFrom: from, attemptedTo: to };
+      return { allowed: true, reason: 'TERMINAL_STATE', attemptedFrom: from, attemptedTo: to };
     }
     if (!canTransition(from, to)) {
killedBy: @fleet/domain - transitionTransportOrder (Result type) returns TERMINAL_STATE when starting from completed
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/state-machines/finite-state-machine.ts:65:14
       return { allowed: false, reason: 'SAME_STATE', attemptedFrom: from, attemptedTo: to };
     }
     if (isTerminal(from)) {
-      return { allowed: false, reason: 'TERMINAL_STATE', attemptedFrom: from, attemptedTo: to };
+      return {};
     }
     if (!canTransition(from, to)) {
killedBy: @fleet/domain - transitionTransportOrder (Result type) returns TERMINAL_STATE when starting from completed
statusReason: expected undefined to be false // Object.is equality

[Killed] ConditionalExpression
src/state-machines/finite-state-machine.ts:67:9
     if (isTerminal(from)) {
       return { allowed: false, reason: 'TERMINAL_STATE', attemptedFrom: from, attemptedTo: to };
     }
-    if (!canTransition(from, to)) {
+    if (false) {
       return { allowed: false, reason: 'INVALID_TRANSITION', attemptedFrom: from, attemptedTo: to };
     }
killedBy: @fleet/domain - transitionTransportOrder (Result type) returns INVALID_TRANSITION for non-terminal illegal moves
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/state-machines/finite-state-machine.ts:67:9
     if (isTerminal(from)) {
       return { allowed: false, reason: 'TERMINAL_STATE', attemptedFrom: from, attemptedTo: to };
     }
-    if (!canTransition(from, to)) {
+    if (canTransition(from, to)) {
       return { allowed: false, reason: 'INVALID_TRANSITION', attemptedFrom: from, attemptedTo: to };
     }
killedBy: @fleet/domain - transitionTransportOrder (Result type) returns allowed=true with nextState on valid transition
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/state-machines/finite-state-machine.ts:68:25
       return { allowed: false, reason: 'TERMINAL_STATE', attemptedFrom: from, attemptedTo: to };
     }
     if (!canTransition(from, to)) {
-      return { allowed: false, reason: 'INVALID_TRANSITION', attemptedFrom: from, attemptedTo: to };
+      return { allowed: true, reason: 'INVALID_TRANSITION', attemptedFrom: from, attemptedTo: to };
     }
     return { allowed: true, nextState: to };
killedBy: @fleet/domain - transitionTransportOrder (Result type) returns INVALID_TRANSITION for non-terminal illegal moves
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/state-machines/finite-state-machine.ts:68:14
       return { allowed: false, reason: 'TERMINAL_STATE', attemptedFrom: from, attemptedTo: to };
     }
     if (!canTransition(from, to)) {
-      return { allowed: false, reason: 'INVALID_TRANSITION', attemptedFrom: from, attemptedTo: to };
+      return {};
     }
     return { allowed: true, nextState: to };
killedBy: @fleet/domain - transitionTransportOrder (Result type) returns INVALID_TRANSITION for non-terminal illegal moves
statusReason: expected undefined to be false // Object.is equality

[Killed] BooleanLiteral
src/state-machines/finite-state-machine.ts:70:23
     if (!canTransition(from, to)) {
       return { allowed: false, reason: 'INVALID_TRANSITION', attemptedFrom: from, attemptedTo: to };
     }
-    return { allowed: true, nextState: to };
+    return { allowed: false, nextState: to };
   };
 
killedBy: @fleet/domain - transitionTransportOrder (Result type) returns allowed=true with nextState on valid transition
statusReason: expected false to be true // Object.is equality
