[Killed] StringLiteral
src/sentry-scrub.ts:7:3
 // from any Node/edge runtime. Pure functions, no I/O, no mutation of inputs.
 
 export const PII_HEADERS = new Set<string>([
-  'authorization',
+  "",
   'cookie',
   'set-cookie',
killedBy: PiiHeaderName branded type + validator isPiiHeader returns true for canonical headers
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/sentry-scrub.ts:22:26
 
 /** Type guard: true if the input is a known PII header (case-insensitive). */
 export function isPiiHeader(name: string): name is PiiHeaderName {
-  return PII_HEADERS.has(name.toLowerCase());
+  return PII_HEADERS.has(name.toUpperCase());
 }
 
killedBy: PiiHeaderName branded type + validator isPiiHeader returns true for canonical headers
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/sentry-scrub.ts:27:43
 
 /** Asserts the input is a known PII header; throws otherwise. Returns branded value. */
 export function assertPiiHeader(name: string): PiiHeaderName {
-  if (!isPiiHeader(name)) throw new Error(`Not a known PII header: ${name}`);
+  if (!isPiiHeader(name)) throw new Error(``);
   return name;
 }
killedBy: mutation-hardening tests assertPiiHeader error message names the offending header
statusReason: expected [Function] to throw error matching /made-up-header/ but got ''

[Killed] Regex
src/sentry-scrub.ts:35:3
   /password|token|secret|authorization|apikey|cookie|push.*token|gps|lat|lng|latitude|longitude|phone|email|ssn|driver.*name/i;
 
 export const PII_VALUE_PATTERNS: readonly RegExp[] = [
-  /Bearer\s+[A-Za-z0-9_.-]+/gi,
+  /Bearer\s+[^A-Za-z0-9_.-]+/gi,
   /eyJ[A-Za-z0-9_-]+\.[A-Za-z0-9_-]+\.[A-Za-z0-9_-]+/g,
   /[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}/g,
killedBy: scrubString redacts Bearer tokens
statusReason: expected 'Bearer abc.def-ghi' to be '[redacted]' // Object.is equality

[Killed] Regex
src/sentry-scrub.ts:36:3
 
 export const PII_VALUE_PATTERNS: readonly RegExp[] = [
   /Bearer\s+[A-Za-z0-9_.-]+/gi,
-  /eyJ[A-Za-z0-9_-]+\.[A-Za-z0-9_-]+\.[A-Za-z0-9_-]+/g,
+  /eyJ[A-Za-z0-9_-]\.[A-Za-z0-9_-]+\.[A-Za-z0-9_-]+/g,
   /[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}/g,
   /(?:\+?\d{1,3}[-.\s]?)?\(?\d{3}\)?[-.\s]?\d{3}[-.\s]?\d{4}/g,
killedBy: scrubString redacts JWTs
statusReason: expected 'eyJhbGc.eyJzdWI.SflKxw' to be '[redacted]' // Object.is equality

[Killed] Regex
src/sentry-scrub.ts:37:3
 export const PII_VALUE_PATTERNS: readonly RegExp[] = [
   /Bearer\s+[A-Za-z0-9_.-]+/gi,
   /eyJ[A-Za-z0-9_-]+\.[A-Za-z0-9_-]+\.[A-Za-z0-9_-]+/g,
-  /[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}/g,
+  /[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]/g,
   /(?:\+?\d{1,3}[-.\s]?)?\(?\d{3}\)?[-.\s]?\d{3}[-.\s]?\d{4}/g,
 ];
killedBy: scrubString redacts emails
statusReason: expected 'contact me at [redacted]om please' to be 'contact me at [redacted] please' // Object.is equality

[Killed] Regex
src/sentry-scrub.ts:37:3
 export const PII_VALUE_PATTERNS: readonly RegExp[] = [
   /Bearer\s+[A-Za-z0-9_.-]+/gi,
   /eyJ[A-Za-z0-9_-]+\.[A-Za-z0-9_-]+\.[A-Za-z0-9_-]+/g,
-  /[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}/g,
+  /[^a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}/g,
   /(?:\+?\d{1,3}[-.\s]?)?\(?\d{3}\)?[-.\s]?\d{3}[-.\s]?\d{4}/g,
 ];
killedBy: scrubString redacts emails
statusReason: expected 'contact me at jane.doe@example.com pl…' to be 'contact me at [redacted] please' // Object.is equality

[Killed] Regex
src/sentry-scrub.ts:38:3
   /Bearer\s+[A-Za-z0-9_.-]+/gi,
   /eyJ[A-Za-z0-9_-]+\.[A-Za-z0-9_-]+\.[A-Za-z0-9_-]+/g,
   /[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}/g,
-  /(?:\+?\d{1,3}[-.\s]?)?\(?\d{3}\)?[-.\s]?\d{3}[-.\s]?\d{4}/g,
+  /(?:\+?\d{1,3}[-.\s]?)?\(?\d{3}\)?[-.\s]?\d{3}[^-.\s]?\d{4}/g,
 ];
 
killedBy: scrubString redacts phone numbers
statusReason: expected 'call +1 (415) 555-0123 now' to be 'call [redacted] now' // Object.is equality

[Killed] Regex
src/sentry-scrub.ts:38:3
   /Bearer\s+[A-Za-z0-9_.-]+/gi,
   /eyJ[A-Za-z0-9_-]+\.[A-Za-z0-9_-]+\.[A-Za-z0-9_-]+/g,
   /[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}/g,
-  /(?:\+?\d{1,3}[-.\s]?)?\(?\d{3}\)?[-.\s]?\d{3}[-.\s]?\d{4}/g,
+  /(?:\+?\d{1,3}[-.\s]?)?\(?\d{3}\)?[-.\s]?\D{3}[-.\s]?\d{4}/g,
 ];
 
killedBy: scrubString redacts phone numbers
statusReason: expected 'call +1 (415) 555-0123 now' to be 'call [redacted] now' // Object.is equality

[Killed] BlockStatement
src/sentry-scrub.ts:94:37
   const onRedact = options.onRedact;
   const scrubStringWithPatterns = (str: string): string => {
     let out = str;
-    for (const re of valuePatterns) {
-      const before = out;
-      out = out.replace(re, REDACTED);
-      if (onRedact && before !== out) onRedact({ kind: 'value', pattern: re });
-    }
+    for (const re of valuePatterns) {}
     return out;
   };
killedBy: createScrubber redacts strings via PII_VALUE_PATTERNS
statusReason: expected 'Bearer abc.def-ghi' to be '[redacted]' // Object.is equality

[Killed] ConditionalExpression
src/sentry-scrub.ts:97:23
     for (const re of valuePatterns) {
       const before = out;
       out = out.replace(re, REDACTED);
-      if (onRedact && before !== out) onRedact({ kind: 'value', pattern: re });
+      if (onRedact && true) onRedact({ kind: 'value', pattern: re });
     }
     return out;
killedBy: createScrubber audit counts does not call onRedact for non-PII data
statusReason: expected 4 to be +0 // Object.is equality

[Killed] EqualityOperator
src/sentry-scrub.ts:97:23
     for (const re of valuePatterns) {
       const before = out;
       out = out.replace(re, REDACTED);
-      if (onRedact && before !== out) onRedact({ kind: 'value', pattern: re });
+      if (onRedact && before === out) onRedact({ kind: 'value', pattern: re });
     }
     return out;
killedBy: createScrubber audit counts does not call onRedact for non-PII data
statusReason: expected 4 to be +0 // Object.is equality

[Killed] LogicalOperator
src/sentry-scrub.ts:102:9
     return out;
   };
   const fn = (value: unknown, depth = 0): unknown => {
-    if (depth > depthLimit || value === null || value === undefined) return value;
+    if (depth > depthLimit && value === null || value === undefined) return value;
     if (typeof value === 'string') return scrubStringWithPatterns(value);
     if (typeof value !== 'object') return value;
killedBy: createScrubber respects custom depthLimit (shallow stops recursion)
statusReason: expected { password: '[redacted]' } to deeply equal { password: 'p' }

[Killed] EqualityOperator
src/sentry-scrub.ts:102:9
     return out;
   };
   const fn = (value: unknown, depth = 0): unknown => {
-    if (depth > depthLimit || value === null || value === undefined) return value;
+    if (depth <= depthLimit || value === null || value === undefined) return value;
     if (typeof value === 'string') return scrubStringWithPatterns(value);
     if (typeof value !== 'object') return value;
killedBy: createScrubber respects custom depthLimit (deep)
statusReason: expected 'p' to be '[redacted]' // Object.is equality

[Killed] ConditionalExpression
src/sentry-scrub.ts:104:9
   const fn = (value: unknown, depth = 0): unknown => {
     if (depth > depthLimit || value === null || value === undefined) return value;
     if (typeof value === 'string') return scrubStringWithPatterns(value);
-    if (typeof value !== 'object') return value;
+    if (false) return value;
     if (Array.isArray(value)) return value.map((v) => fn(v, depth + 1));
     try {
killedBy: createScrubber passes through primitives
statusReason: expected {} to be 42 // Object.is equality

[Killed] EqualityOperator
src/sentry-scrub.ts:104:9
   const fn = (value: unknown, depth = 0): unknown => {
     if (depth > depthLimit || value === null || value === undefined) return value;
     if (typeof value === 'string') return scrubStringWithPatterns(value);
-    if (typeof value !== 'object') return value;
+    if (typeof value === 'object') return value;
     if (Array.isArray(value)) return value.map((v) => fn(v, depth + 1));
     try {
killedBy: createScrubber respects custom depthLimit (deep)
statusReason: expected 'p' to be '[redacted]' // Object.is equality

[Killed] ArrowFunction
src/sentry-scrub.ts:105:48
     if (depth > depthLimit || value === null || value === undefined) return value;
     if (typeof value === 'string') return scrubStringWithPatterns(value);
     if (typeof value !== 'object') return value;
-    if (Array.isArray(value)) return value.map((v) => fn(v, depth + 1));
+    if (Array.isArray(value)) return value.map(() => undefined);
     try {
       const out: Record<string, unknown> = {};
killedBy: createScrubber handles arrays
statusReason: expected undefined to be '[redacted]' // Object.is equality

[Survived] ArithmeticOperator
src/sentry-scrub.ts:105:61
     if (depth > depthLimit || value === null || value === undefined) return value;
     if (typeof value === 'string') return scrubStringWithPatterns(value);
     if (typeof value !== 'object') return value;
-    if (Array.isArray(value)) return value.map((v) => fn(v, depth + 1));
+    if (Array.isArray(value)) return value.map((v) => fn(v, depth - 1));
     try {
       const out: Record<string, unknown> = {};

[Killed] BlockStatement
src/sentry-scrub.ts:108:78
     if (Array.isArray(value)) return value.map((v) => fn(v, depth + 1));
     try {
       const out: Record<string, unknown> = {};
-      for (const [k, v] of Object.entries(value as Record<string, unknown>)) {
-        if (keyPattern.test(k)) {
-          out[k] = REDACTED;
-          onRedact?.({ kind: 'key', key: k });
-        } else {
-          out[k] = fn(v, depth + 1);
-        }
-      }
+      for (const [k, v] of Object.entries(value as Record<string, unknown>)) {}
       return out;
     } catch (err) {
killedBy: createScrubber with custom config uses custom piiKeyPattern when provided
statusReason: expected undefined to be '[redacted]' // Object.is equality

[Killed] BlockStatement
src/sentry-scrub.ts:109:33
     try {
       const out: Record<string, unknown> = {};
       for (const [k, v] of Object.entries(value as Record<string, unknown>)) {
-        if (keyPattern.test(k)) {
-          out[k] = REDACTED;
-          onRedact?.({ kind: 'key', key: k });
-        } else {
+        if (keyPattern.test(k)) {} else {
           out[k] = fn(v, depth + 1);
         }
killedBy: createScrubber with custom config uses custom piiKeyPattern when provided
statusReason: expected undefined to be '[redacted]' // Object.is equality

[Killed] ConditionalExpression
src/sentry-scrub.ts:109:13
     try {
       const out: Record<string, unknown> = {};
       for (const [k, v] of Object.entries(value as Record<string, unknown>)) {
-        if (keyPattern.test(k)) {
+        if (false) {
           out[k] = REDACTED;
           onRedact?.({ kind: 'key', key: k });
killedBy: createScrubber with custom config uses custom piiKeyPattern when provided
statusReason: expected 'hide' to be '[redacted]' // Object.is equality

[Killed] BlockStatement
src/sentry-scrub.ts:112:16
         if (keyPattern.test(k)) {
           out[k] = REDACTED;
           onRedact?.({ kind: 'key', key: k });
-        } else {
-          out[k] = fn(v, depth + 1);
-        }
+        } else {}
       }
       return out;
killedBy: createScrubber with custom config uses custom piiKeyPattern when provided
statusReason: expected undefined to be 'keep' // Object.is equality

[Killed] ArithmeticOperator
src/sentry-scrub.ts:113:26
           out[k] = REDACTED;
           onRedact?.({ kind: 'key', key: k });
         } else {
-          out[k] = fn(v, depth + 1);
+          out[k] = fn(v, depth - 1);
         }
       }
killedBy: createScrubber respects custom depthLimit (shallow stops recursion)
statusReason: expected { password: '[redacted]' } to deeply equal { password: 'p' }

[Killed] BlockStatement
src/sentry-scrub.ts:136:91
  * scrub() function. Process-level: callers using createScrubber should pass
  * onScrubError per-instance instead.
  */
-export function setScrubErrorHandler(handler: ((err: unknown) => void) | undefined): void {
-  moduleScrubErrorHandler = handler;
-}
+export function setScrubErrorHandler(handler: ((err: unknown) => void) | undefined): void {}
 
 /**
killedBy: scrub error observability (top-level) exposes setScrubErrorHandler that receives errors from default scrub()
statusReason: expected [] to have a length of 1 but got +0

[Killed] EqualityOperator
src/sentry-scrub.ts:146:7
  * Errors caught here flow through the handler set by setScrubErrorHandler.
  */
 export function scrub(value: unknown, depth = 0): unknown {
-  if (depth > DEFAULT_DEPTH_LIMIT || value === null || value === undefined) return value;
+  if (depth <= DEFAULT_DEPTH_LIMIT || value === null || value === undefined) return value;
   if (typeof value === 'string') return scrubString(value);
   if (typeof value !== 'object') return value;
killedBy: scrub - property-based redacts any key matching PII regex regardless of value shape
statusReason: Property failed after 1 tests
{ seed: 827180870, path: "0:0", endOnFailure: true }
Counterexample: [false]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] LogicalOperator
src/sentry-scrub.ts:146:7
  * Errors caught here flow through the handler set by setScrubErrorHandler.
  */
 export function scrub(value: unknown, depth = 0): unknown {
-  if (depth > DEFAULT_DEPTH_LIMIT || value === null || value === undefined) return value;
+  if (depth > DEFAULT_DEPTH_LIMIT && value === null || value === undefined) return value;
   if (typeof value === 'string') return scrubString(value);
   if (typeof value !== 'object') return value;
killedBy: scrub (purity + structure) returns primitives unchanged
statusReason: expected '[unscrubbable]' to be null // Object.is equality

[Killed] ConditionalExpression
src/sentry-scrub.ts:148:7
 export function scrub(value: unknown, depth = 0): unknown {
   if (depth > DEFAULT_DEPTH_LIMIT || value === null || value === undefined) return value;
   if (typeof value === 'string') return scrubString(value);
-  if (typeof value !== 'object') return value;
+  if (false) return value;
   if (Array.isArray(value)) return value.map((v) => scrub(v, depth + 1));
   try {
killedBy: scrub - non-serializable values passes through symbols (typeof symbol -> not object)
statusReason: expected {} to be Symbol(s) // Object.is equality

[Killed] EqualityOperator
src/sentry-scrub.ts:148:7
 export function scrub(value: unknown, depth = 0): unknown {
   if (depth > DEFAULT_DEPTH_LIMIT || value === null || value === undefined) return value;
   if (typeof value === 'string') return scrubString(value);
-  if (typeof value !== 'object') return value;
+  if (typeof value === 'object') return value;
   if (Array.isArray(value)) return value.map((v) => scrub(v, depth + 1));
   try {
killedBy: scrub - property-based redacts any key matching PII regex regardless of value shape
statusReason: Property failed after 1 tests
{ seed: 677815263, path: "0", endOnFailure: true }
Counterexample: [null]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArrowFunction
src/sentry-scrub.ts:149:46
   if (depth > DEFAULT_DEPTH_LIMIT || value === null || value === undefined) return value;
   if (typeof value === 'string') return scrubString(value);
   if (typeof value !== 'object') return value;
-  if (Array.isArray(value)) return value.map((v) => scrub(v, depth + 1));
+  if (Array.isArray(value)) return value.map(() => undefined);
   try {
     const out: Record<string, unknown> = {};
killedBy: scrub (purity + structure) handles arrays
statusReason: expected undefined to be 'hello' // Object.is equality

[Survived] ArithmeticOperator
src/sentry-scrub.ts:149:62
   if (depth > DEFAULT_DEPTH_LIMIT || value === null || value === undefined) return value;
   if (typeof value === 'string') return scrubString(value);
   if (typeof value !== 'object') return value;
-  if (Array.isArray(value)) return value.map((v) => scrub(v, depth + 1));
+  if (Array.isArray(value)) return value.map((v) => scrub(v, depth - 1));
   try {
     const out: Record<string, unknown> = {};

[Killed] BlockStatement
src/sentry-scrub.ts:152:76
   if (Array.isArray(value)) return value.map((v) => scrub(v, depth + 1));
   try {
     const out: Record<string, unknown> = {};
-    for (const [k, v] of Object.entries(value as Record<string, unknown>)) {
-      out[k] = PII_KEY_RE.test(k) ? REDACTED : scrub(v, depth + 1);
-    }
+    for (const [k, v] of Object.entries(value as Record<string, unknown>)) {}
     return out;
   } catch (err) {
killedBy: scrub - property-based redacts any key matching PII regex regardless of value shape
statusReason: Property failed after 1 tests
{ seed: 681591609, path: "0:0", endOnFailure: true }
Counterexample: [{}]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
src/sentry-scrub.ts:153:57
   try {
     const out: Record<string, unknown> = {};
     for (const [k, v] of Object.entries(value as Record<string, unknown>)) {
-      out[k] = PII_KEY_RE.test(k) ? REDACTED : scrub(v, depth + 1);
+      out[k] = PII_KEY_RE.test(k) ? REDACTED : scrub(v, depth - 1);
     }
     return out;
killedBy: mutation-hardening tests default scrub recursion direction: deeper objects exceed DEFAULT_DEPTH_LIMIT
statusReason: expected '[redacted]' to be 'leaked' // Object.is equality

[Killed] BlockStatement
src/sentry-scrub.ts:177:41
   headers: Record<string, string | string[]>,
 ): Record<string, string | string[]> {
   const out: Record<string, string | string[]> = {};
-  for (const k of Object.keys(headers)) {
-    const v = headers[k];
-    if (v === undefined) continue;
-    if (PII_HEADERS.has(k.toLowerCase())) {
-      out[k] = Array.isArray(v) ? [REDACTED] : REDACTED;
-    } else {
-      out[k] = v;
-    }
-  }
+  for (const k of Object.keys(headers)) {}
   return out;
 }
killedBy: scrubEvent (purity) redacts PII headers, preserves others, handles array values
statusReason: expected undefined to be '[redacted]' // Object.is equality

[Killed] BlockStatement
src/sentry-scrub.ts:180:43
   for (const k of Object.keys(headers)) {
     const v = headers[k];
     if (v === undefined) continue;
-    if (PII_HEADERS.has(k.toLowerCase())) {
-      out[k] = Array.isArray(v) ? [REDACTED] : REDACTED;
-    } else {
+    if (PII_HEADERS.has(k.toLowerCase())) {} else {
       out[k] = v;
     }
killedBy: scrubEvent (purity) redacts PII headers, preserves others, handles array values
statusReason: expected undefined to be '[redacted]' // Object.is equality

[Killed] BlockStatement
src/sentry-scrub.ts:182:12
     if (v === undefined) continue;
     if (PII_HEADERS.has(k.toLowerCase())) {
       out[k] = Array.isArray(v) ? [REDACTED] : REDACTED;
-    } else {
-      out[k] = v;
-    }
+    } else {}
   }
   return out;
killedBy: scrubEvent (purity) redacts PII headers, preserves others, handles array values
statusReason: expected undefined to be 't' // Object.is equality

[Killed] BlockStatement
src/sentry-scrub.ts:196:41
 export function scrubEvent<T extends ScrubbableEvent>(event: T): T {
   const next: T = { ...event };
 
-  if (typeof next.message === 'string') {
-    next.message = scrubString(next.message);
-  }
+  if (typeof next.message === 'string') {}
 
   if (next.exception?.values) {
killedBy: scrubEvent (purity) redacts message
statusReason: expected 'Bearer abc.def-ghi' to be '[redacted]' // Object.is equality

[Killed] BlockStatement
src/sentry-scrub.ts:200:31
     next.message = scrubString(next.message);
   }
 
-  if (next.exception?.values) {
-    next.exception = {
-      ...next.exception,
-      values: next.exception.values.map((ex) =>
-        typeof ex.value === 'string' ? { ...ex, value: scrubString(ex.value) } : ex,
-      ),
-    };
-  }
+  if (next.exception?.values) {}
 
   if (next.request) {
killedBy: scrubEvent (purity) redacts exception values
statusReason: expected 'oops a@b.co' to be 'oops [redacted]' // Object.is equality

[Killed] ObjectLiteral
src/sentry-scrub.ts:204:40
     next.exception = {
       ...next.exception,
       values: next.exception.values.map((ex) =>
-        typeof ex.value === 'string' ? { ...ex, value: scrubString(ex.value) } : ex,
+        typeof ex.value === 'string' ? {} : ex,
       ),
     };
killedBy: scrubEvent (purity) redacts exception values
statusReason: expected undefined to be 'oops [redacted]' // Object.is equality

[Killed] BlockStatement
src/sentry-scrub.ts:209:21
     };
   }
 
-  if (next.request) {
-    const req = { ...next.request };
-    if (req.headers) req.headers = scrubHeaders(req.headers);
-    if (req.data !== undefined) req.data = scrub(req.data);
-    next.request = req;
-  }
+  if (next.request) {}
 
   if (next.extra) next.extra = scrub(next.extra) as Record<string, unknown>;
killedBy: scrubEvent (purity) redacts PII headers, preserves others, handles array values
statusReason: expected 'Bearer x' to be '[redacted]' // Object.is equality

[Killed] ConditionalExpression
src/sentry-scrub.ts:209:7
     };
   }
 
-  if (next.request) {
+  if (true) {
     const req = { ...next.request };
     if (req.headers) req.headers = scrubHeaders(req.headers);
killedBy: scrubEvent (purity) handles empty event
statusReason: expected { request: {} } to deeply equal {}

[Killed] EqualityOperator
src/sentry-scrub.ts:212:9
   if (next.request) {
     const req = { ...next.request };
     if (req.headers) req.headers = scrubHeaders(req.headers);
-    if (req.data !== undefined) req.data = scrub(req.data);
+    if (req.data === undefined) req.data = scrub(req.data);
     next.request = req;
   }
killedBy: scrubEvent (purity) scrubs request.data, extra, contexts
statusReason: expected 'p' to be '[redacted]' // Object.is equality

[Killed] ConditionalExpression
src/sentry-scrub.ts:212:9
   if (next.request) {
     const req = { ...next.request };
     if (req.headers) req.headers = scrubHeaders(req.headers);
-    if (req.data !== undefined) req.data = scrub(req.data);
+    if (false) req.data = scrub(req.data);
     next.request = req;
   }
killedBy: scrubEvent (purity) scrubs request.data, extra, contexts
statusReason: expected 'p' to be '[redacted]' // Object.is equality

[Killed] ConditionalExpression
src/sentry-scrub.ts:216:7
     next.request = req;
   }
 
-  if (next.extra) next.extra = scrub(next.extra) as Record<string, unknown>;
+  if (false) next.extra = scrub(next.extra) as Record<string, unknown>;
   if (next.contexts) next.contexts = scrub(next.contexts) as Record<string, unknown>;
 
killedBy: scrubEvent (purity) scrubs request.data, extra, contexts
statusReason: expected 't' to be '[redacted]' // Object.is equality

[Killed] ConditionalExpression
src/sentry-scrub.ts:216:7
     next.request = req;
   }
 
-  if (next.extra) next.extra = scrub(next.extra) as Record<string, unknown>;
+  if (true) next.extra = scrub(next.extra) as Record<string, unknown>;
   if (next.contexts) next.contexts = scrub(next.contexts) as Record<string, unknown>;
 
killedBy: mutation-hardening tests scrubEvent does not add extra/contexts when absent
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/sentry-scrub.ts:217:7
   }
 
   if (next.extra) next.extra = scrub(next.extra) as Record<string, unknown>;
-  if (next.contexts) next.contexts = scrub(next.contexts) as Record<string, unknown>;
+  if (false) next.contexts = scrub(next.contexts) as Record<string, unknown>;
 
   return next;
killedBy: scrubEvent (purity) scrubs request.data, extra, contexts
statusReason: expected 's' to be '[redacted]' // Object.is equality

[Killed] ConditionalExpression
src/sentry-scrub.ts:217:7
   }
 
   if (next.extra) next.extra = scrub(next.extra) as Record<string, unknown>;
-  if (next.contexts) next.contexts = scrub(next.contexts) as Record<string, unknown>;
+  if (true) next.contexts = scrub(next.contexts) as Record<string, unknown>;
 
   return next;
killedBy: mutation-hardening tests scrubEvent does not add extra/contexts when absent
statusReason: expected true to be false // Object.is equality
