[Killed] Regex
src/sentry-scrub.ts:39:3
 }
 
 export const PII_KEY_RE =
-  /password|token|secret|authorization|apikey|cookie|push.*token|gps|lat|lng|latitude|longitude|phone|email|ssn|driver.*name/i;
+  /password|token|secret|authorization|apikey|cookie|push.*token|gps|lat|lng|latitude|longitude|phone|email|ssn|driver.name/i;
 
 export const PII_VALUE_PATTERNS: readonly RegExp[] = [
killedBy: mutation-hardening tests PII_KEY_RE: driver.*name matches with multiple chars between (kills driver.*name -> driver.name mutant)
statusReason: expected false to be true // Object.is equality

[Killed] ArrayDeclaration
src/sentry-scrub.ts:41:54
 export const PII_KEY_RE =
   /password|token|secret|authorization|apikey|cookie|push.*token|gps|lat|lng|latitude|longitude|phone|email|ssn|driver.*name/i;
 
-export const PII_VALUE_PATTERNS: readonly RegExp[] = [
-  /Bearer\s+[A-Za-z0-9_.-]+/gi,
-  /eyJ[A-Za-z0-9_-]+\.[A-Za-z0-9_-]+\.[A-Za-z0-9_-]+/g,
-  /[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}/g,
-  /(?:\+?\d{1,3}[-.\s]?)?\(?\d{3}\)?[-.\s]?\d{3}[-.\s]?\d{4}/g,
-];
+export const PII_VALUE_PATTERNS: readonly RegExp[] = [];
 
 /**
killedBy: PII no-leak invariant (property-based) original Bearer token never appears in scrubbed string
statusReason: Property failed after 1 tests
{ seed: -1332867187, path: "0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: ["-0-0-00-0-"]
Shrunk 48 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] Regex
src/sentry-scrub.ts:43:3
 
 export const PII_VALUE_PATTERNS: readonly RegExp[] = [
   /Bearer\s+[A-Za-z0-9_.-]+/gi,
-  /eyJ[A-Za-z0-9_-]+\.[A-Za-z0-9_-]+\.[A-Za-z0-9_-]+/g,
+  /eyJ[A-Za-z0-9_-]+\.[^A-Za-z0-9_-]+\.[A-Za-z0-9_-]+/g,
   /[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}/g,
   /(?:\+?\d{1,3}[-.\s]?)?\(?\d{3}\)?[-.\s]?\d{3}[-.\s]?\d{4}/g,
killedBy: scrubString redacts JWTs
statusReason: expected 'eyJhbGc.eyJzdWI.SflKxw' to be '[redacted]' // Object.is equality

[Killed] Regex
src/sentry-scrub.ts:43:3
 
 export const PII_VALUE_PATTERNS: readonly RegExp[] = [
   /Bearer\s+[A-Za-z0-9_.-]+/gi,
-  /eyJ[A-Za-z0-9_-]+\.[A-Za-z0-9_-]+\.[A-Za-z0-9_-]+/g,
+  /eyJ[A-Za-z0-9_-]+\.[A-Za-z0-9_-]+\.[A-Za-z0-9_-]/g,
   /[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}/g,
   /(?:\+?\d{1,3}[-.\s]?)?\(?\d{3}\)?[-.\s]?\d{3}[-.\s]?\d{4}/g,
killedBy: scrubString redacts JWTs
statusReason: expected '[redacted]flKxw' to be '[redacted]' // Object.is equality

[Killed] Regex
src/sentry-scrub.ts:44:3
 export const PII_VALUE_PATTERNS: readonly RegExp[] = [
   /Bearer\s+[A-Za-z0-9_.-]+/gi,
   /eyJ[A-Za-z0-9_-]+\.[A-Za-z0-9_-]+\.[A-Za-z0-9_-]+/g,
-  /[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}/g,
+  /[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]\.[a-zA-Z]{2,}/g,
   /(?:\+?\d{1,3}[-.\s]?)?\(?\d{3}\)?[-.\s]?\d{3}[-.\s]?\d{4}/g,
 ];
killedBy: scrubString redacts emails
statusReason: expected 'contact me at jane.doe@example.com pl…' to be 'contact me at [redacted] please' // Object.is equality

[Killed] Regex
src/sentry-scrub.ts:45:3
   /Bearer\s+[A-Za-z0-9_.-]+/gi,
   /eyJ[A-Za-z0-9_-]+\.[A-Za-z0-9_-]+\.[A-Za-z0-9_-]+/g,
   /[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}/g,
-  /(?:\+?\d{1,3}[-.\s]?)?\(?\d{3}\)?[-.\s]?\d{3}[-.\s]?\d{4}/g,
+  /(?:\+?\d{1,3}[-.\S]?)?\(?\d{3}\)?[-.\s]?\d{3}[-.\s]?\d{4}/g,
 ];
 
killedBy: scrubString redacts phone numbers
statusReason: expected 'call +1 [redacted] now' to be 'call [redacted] now' // Object.is equality

[Killed] Regex
src/sentry-scrub.ts:45:3
   /Bearer\s+[A-Za-z0-9_.-]+/gi,
   /eyJ[A-Za-z0-9_-]+\.[A-Za-z0-9_-]+\.[A-Za-z0-9_-]+/g,
   /[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}/g,
-  /(?:\+?\d{1,3}[-.\s]?)?\(?\d{3}\)?[-.\s]?\d{3}[-.\s]?\d{4}/g,
+  /(?:\+?\d{1,3}[-.\s]?)?\(?\d{3}\)?[^-.\s]?\d{3}[-.\s]?\d{4}/g,
 ];
 
killedBy: scrubString redacts phone numbers
statusReason: expected 'call +1 (415) 555-0123 now' to be 'call [redacted] now' // Object.is equality

[Killed] ConditionalExpression
src/sentry-scrub.ts:109:9
     return out;
   };
   const fn = (value: unknown, depth = 0): unknown => {
-    if (depth > depthLimit || value === null || value === undefined) return value;
+    if (false) return value;
     if (typeof value === 'string') return scrubStringWithPatterns(value);
     if (typeof value !== 'object') return value;
killedBy: createScrubber respects custom depthLimit (shallow stops recursion)
statusReason: expected { password: '[redacted]' } to deeply equal { password: 'p' }

[Killed] ConditionalExpression
src/sentry-scrub.ts:109:9
     return out;
   };
   const fn = (value: unknown, depth = 0): unknown => {
-    if (depth > depthLimit || value === null || value === undefined) return value;
+    if (false || value === undefined) return value;
     if (typeof value === 'string') return scrubStringWithPatterns(value);
     if (typeof value !== 'object') return value;
killedBy: createScrubber respects custom depthLimit (shallow stops recursion)
statusReason: expected { password: '[redacted]' } to deeply equal { password: 'p' }

[Killed] ConditionalExpression
src/sentry-scrub.ts:116:13
     try {
       const out: Record<string, unknown> = {};
       for (const [k, v] of Object.entries(value as Record<string, unknown>)) {
-        if (keyPattern.test(k)) {
+        if (true) {
           out[k] = REDACTED;
           onRedact?.({ kind: 'key', key: k });
killedBy: createBeforeSend full coverage paths annotateEvent merges into existing extra
statusReason: expected '[redacted]' to be 'keep' // Object.is equality

[Killed] LogicalOperator
src/sentry-scrub.ts:153:7
  * Errors caught here flow through the handler set by setScrubErrorHandler.
  */
 export function scrub(value: unknown, depth = 0): unknown {
-  if (depth > DEFAULT_DEPTH_LIMIT || value === null || value === undefined) return value;
+  if ((depth > DEFAULT_DEPTH_LIMIT || value === null) && value === undefined) return value;
   if (typeof value === 'string') return scrubString(value);
   if (typeof value !== 'object') return value;
killedBy: scrub (purity + structure) returns primitives unchanged
statusReason: expected '[unscrubbable]' to be null // Object.is equality

[Killed] ArrayDeclaration
src/sentry-scrub.ts:188:35
     const v = headers[k];
     if (v === undefined) continue;
     if (PII_HEADERS.has(k.toLowerCase())) {
-      out[k] = Array.isArray(v) ? [REDACTED] : REDACTED;
+      out[k] = Array.isArray(v) ? [] : REDACTED;
     } else {
       out[k] = v;
killedBy: scrubEvent (purity) redacts PII headers, preserves others, handles array values
statusReason: expected [] to deeply equal [ '[redacted]' ]

[Killed] ConditionalExpression
src/sentry-scrub.ts:219:9
   if (next.request) {
     const req = { ...next.request };
     if (req.headers) req.headers = scrubHeaders(req.headers);
-    if (req.data !== undefined) req.data = scrub(req.data);
+    if (true) req.data = scrub(req.data);
     next.request = req;
   }
killedBy: mutation-hardening tests scrubEvent does not call scrub when request.data is absent
statusReason: expected true to be false // Object.is equality
