[Killed] StringLiteral
src/identity/revocation.ts:15:3
   'operator_logout',
   'admin_revoke',
   'device_lost',
-  'session_superseded',
+  "",
   'shift_end',
   'security_incident',
killedBy: @fleet/domain - RevocationReasonSchema v1 reasons remain accepted (additive evolution invariant)
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/identity/revocation.ts:17:3
   'device_lost',
   'session_superseded',
   'shift_end',
-  'security_incident',
+  "",
   'config_breaking_change',
 ]);
killedBy: @fleet/domain - RevocationReasonSchema v1 reasons remain accepted (additive evolution invariant)
statusReason: expected false to be true // Object.is equality
