[Killed] StringLiteral
src/identity/surface.ts:11:45
  *
  * @see Frozen Stack PDF section "Session/revocation"
  */
-export const SessionSurfaceSchema = z.enum(['road', 'yard', 'depot', 'dispatch']);
+export const SessionSurfaceSchema = z.enum(["", 'yard', 'depot', 'dispatch']);
 export type SessionSurface = z.infer<typeof SessionSurfaceSchema>;
 
killedBy: @fleet/domain - SessionSurfaceSchema rejects spoofed surfaces from network payloads
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
src/identity/surface.ts:11:70
  *
  * @see Frozen Stack PDF section "Session/revocation"
  */
-export const SessionSurfaceSchema = z.enum(['road', 'yard', 'depot', 'dispatch']);
+export const SessionSurfaceSchema = z.enum(['road', 'yard', 'depot', ""]);
 export type SessionSurface = z.infer<typeof SessionSurfaceSchema>;
 
killedBy: @fleet/domain - SessionSurfaceSchema rejects spoofed surfaces from network payloads
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
src/identity/surface.ts:23:42
  *
  * @see Frozen Stack PDF section "Session/revocation"
  */
-export const SessionModeSchema = z.enum(['mutating', 'shadow']);
+export const SessionModeSchema = z.enum(["", 'shadow']);
 export type SessionMode = z.infer<typeof SessionModeSchema>;
 
killedBy: @fleet/domain - SessionModeSchema parses mutating + shadow modes
statusReason: [
  {
    "received": "mutating",
    "code": "invalid_enum_value",
    "options": [
      "",
      "shadow"
    ],
