[Killed] Regex
src/dsn.ts:8:19
 // whether a malformed DSN should fail-fast or skip Sentry init silently.
 import { z } from 'zod';
 
-const DSN_REGEX = /^https:\/\/[a-f0-9]+@[a-zA-Z0-9.-]+\/\d+$/;
+const DSN_REGEX = /^https:\/\/[a-f0-9]+@[a-zA-Z0-9.-]+\/\D+$/;
 
 export const dsnSchema = z
killedBy: parseDsn accepts valid DSN
statusReason: expected false to be true // Object.is equality

[Killed] Regex
src/dsn.ts:8:19
 // whether a malformed DSN should fail-fast or skip Sentry init silently.
 import { z } from 'zod';
 
-const DSN_REGEX = /^https:\/\/[a-f0-9]+@[a-zA-Z0-9.-]+\/\d+$/;
+const DSN_REGEX = /^https:\/\/[a-f0-9]@[a-zA-Z0-9.-]+\/\d+$/;
 
 export const dsnSchema = z
killedBy: buildSentryOptions returns full options for valid DSN
statusReason: expected null not to be null

[Killed] MethodExpression
src/dsn.ts:10:26
 
 const DSN_REGEX = /^https:\/\/[a-f0-9]+@[a-zA-Z0-9.-]+\/\d+$/;
 
-export const dsnSchema = z
-  .string()
-  .min(1, 'DSN must not be empty')
+export const dsnSchema = z.string().max(1, 'DSN must not be empty')
   .regex(DSN_REGEX, 'DSN must match https://<publicKey>@<host>/<projectId>');
 
killedBy: parseDsn accepts valid DSN
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
src/dsn.ts:13:21
 export const dsnSchema = z
   .string()
   .min(1, 'DSN must not be empty')
-  .regex(DSN_REGEX, 'DSN must match https://<publicKey>@<host>/<projectId>');
+  .regex(DSN_REGEX, "");
 
 export type ValidatedDsn = z.infer<typeof dsnSchema>;

[Killed] EqualityOperator
src/dsn.ts:28:30
  * callers can choose between fail-fast and skip-init behavior.
  */
 export function parseDsn(input: string | undefined): DsnParseResult {
-  if (input === undefined || input === '') {
+  if (input === undefined || input !== '') {
     return { valid: false, error: 'DSN is undefined or empty' };
   }
killedBy: parseDsn accepts valid DSN
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/dsn.ts:28:7
  * callers can choose between fail-fast and skip-init behavior.
  */
 export function parseDsn(input: string | undefined): DsnParseResult {
-  if (input === undefined || input === '') {
+  if (input !== undefined || input === '') {
     return { valid: false, error: 'DSN is undefined or empty' };
   }
killedBy: buildSentryOptions returns full options for valid DSN
statusReason: expected null not to be null

[Killed] BooleanLiteral
src/dsn.ts:29:21
  */
 export function parseDsn(input: string | undefined): DsnParseResult {
   if (input === undefined || input === '') {
-    return { valid: false, error: 'DSN is undefined or empty' };
+    return { valid: true, error: 'DSN is undefined or empty' };
   }
   const result = dsnSchema.safeParse(input);
killedBy: parseDsn rejects undefined
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
src/dsn.ts:29:35
  */
 export function parseDsn(input: string | undefined): DsnParseResult {
   if (input === undefined || input === '') {
-    return { valid: false, error: 'DSN is undefined or empty' };
+    return { valid: false, error: "" };
   }
   const result = dsnSchema.safeParse(input);
killedBy: parseDsn anchor + error message tests (mutation hardening) error for empty string is "DSN is undefined or empty"
statusReason: expected '' to be 'DSN is undefined or empty' // Object.is equality

[Killed] BooleanLiteral
src/dsn.ts:35:21
   if (!result.success) {
     // zod safeParse always populates issues[0] on failure; non-null assertion is safe
     /* c8 ignore next */
-    return { valid: false, error: result.error.issues[0]?.message ?? 'Invalid DSN' };
+    return { valid: true, error: result.error.issues[0]?.message ?? 'Invalid DSN' };
   }
   return { valid: true, dsn: result.data };
killedBy: parseDsn rejects non-https
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/dsn.ts:37:19
     /* c8 ignore next */
     return { valid: false, error: result.error.issues[0]?.message ?? 'Invalid DSN' };
   }
-  return { valid: true, dsn: result.data };
+  return { valid: false, dsn: result.data };
 }
 
killedBy: parseDsn accepts valid DSN
statusReason: expected false to be true // Object.is equality
