[Killed] ArrowFunction
src/scrubber-config.ts:6:38
 // patterns, non-RegExp values) before they reach a redaction code path.
 import { z } from 'zod';
 
-const regexSchema = z.custom<RegExp>((v) => v instanceof RegExp, 'must be a RegExp');
+const regexSchema = z.custom<RegExp>(() => undefined, 'must be a RegExp');
 
 export const scrubberConfigSchema = z
killedBy: scrubberConfigSchema accepts full valid config
statusReason: [
  {
    "code": "custom",
    "message": "must be a RegExp",
    "fatal": true,
    "path": [
      "piiKeyPattern"
    ]

[Survived] StringLiteral
src/scrubber-config.ts:6:66
 // patterns, non-RegExp values) before they reach a redaction code path.
 import { z } from 'zod';
 
-const regexSchema = z.custom<RegExp>((v) => v instanceof RegExp, 'must be a RegExp');
+const regexSchema = z.custom<RegExp>((v) => v instanceof RegExp, "");
 
 export const scrubberConfigSchema = z

[Killed] MethodExpression
src/scrubber-config.ts:11:17
 export const scrubberConfigSchema = z
   .object({
     /** Max recursion depth before bailing. */
-    depthLimit: z.number().int().min(0).max(50).optional(),
+    depthLimit: z.number().int().min(0).min(50).optional(),
     /** Regex matching object keys whose values should be redacted. */
     piiKeyPattern: regexSchema.optional(),
killedBy: scrubberConfigSchema accepts full valid config
statusReason: [
  {
    "code": "too_small",
    "minimum": 50,
    "type": "number",
    "inclusive": true,
    "exact": false,
    "message": "Number must be greater than or equal to 50",

[Killed] MethodExpression
src/scrubber-config.ts:11:17
 export const scrubberConfigSchema = z
   .object({
     /** Max recursion depth before bailing. */
-    depthLimit: z.number().int().min(0).max(50).optional(),
+    depthLimit: z.number().int().max(0).max(50).optional(),
     /** Regex matching object keys whose values should be redacted. */
     piiKeyPattern: regexSchema.optional(),
killedBy: scrubberConfigSchema accepts full valid config
statusReason: [
  {
    "code": "too_big",
    "maximum": 0,
    "type": "number",
    "inclusive": true,
    "exact": false,
    "message": "Number must be less than or equal to 0",

[Killed] MethodExpression
src/scrubber-config.ts:15:25
     /** Regex matching object keys whose values should be redacted. */
     piiKeyPattern: regexSchema.optional(),
     /** Header names (lowercase) whose values should be redacted. */
-    piiHeaders: z.array(z.string().min(1)).optional(),
+    piiHeaders: z.array(z.string().max(1)).optional(),
     /** Regexes that match PII substrings inside string values. */
     piiValuePatterns: z.array(regexSchema).optional(),
killedBy: scrubberConfigSchema accepts full valid config
statusReason: [
  {
    "code": "too_big",
    "maximum": 1,
    "type": "string",
    "inclusive": true,
    "exact": false,
    "message": "String must contain at most 1 character(s)",

[Killed] EqualityOperator
src/scrubber-config.ts:19:59
     /** Regexes that match PII substrings inside string values. */
     piiValuePatterns: z.array(regexSchema).optional(),
     /** Hook called when scrub catches a throw. */
-    onScrubError: z.custom<(err: unknown) => void>((v) => typeof v === 'function').optional(),
+    onScrubError: z.custom<(err: unknown) => void>((v) => typeof v !== 'function').optional(),
   })
   .strict();
killedBy: scrubberConfigSchema accepts full valid config
statusReason: [
  {
    "code": "custom",
    "fatal": true,
    "path": [
      "onScrubError"
    ],
    "message": "Invalid input"

[Killed] ConditionalExpression
src/scrubber-config.ts:19:59
     /** Regexes that match PII substrings inside string values. */
     piiValuePatterns: z.array(regexSchema).optional(),
     /** Hook called when scrub catches a throw. */
-    onScrubError: z.custom<(err: unknown) => void>((v) => typeof v === 'function').optional(),
+    onScrubError: z.custom<(err: unknown) => void>((v) => true).optional(),
   })
   .strict();
killedBy: scrubberConfigSchema error messages (mutation hardening) onScrubError validator rejects non-function values
statusReason: expected [Function] to throw an error
