[Killed] LogicalOperator
src/sentry-init.ts:40:20
  * input (NaN, negative, > 1, undefined). Defensive against env-var typos.
  */
 export function parseTracesSampleRate(raw: string | undefined): number {
-  const n = Number(raw ?? DEFAULT_TRACES_SAMPLE_RATE);
+  const n = Number(raw && DEFAULT_TRACES_SAMPLE_RATE);
   if (!Number.isFinite(n) || n < 0 || n > 1) return DEFAULT_TRACES_SAMPLE_RATE;
   return n;
killedBy: parseTracesSampleRate accepts valid 0
statusReason: expected 0.1 to be +0 // Object.is equality

[Killed] BooleanLiteral
src/sentry-init.ts:41:7
  */
 export function parseTracesSampleRate(raw: string | undefined): number {
   const n = Number(raw ?? DEFAULT_TRACES_SAMPLE_RATE);
-  if (!Number.isFinite(n) || n < 0 || n > 1) return DEFAULT_TRACES_SAMPLE_RATE;
+  if (Number.isFinite(n) || n < 0 || n > 1) return DEFAULT_TRACES_SAMPLE_RATE;
   return n;
 }
killedBy: parseTracesSampleRate returns 0.1 default for NaN
statusReason: expected NaN to be 0.1 // Object.is equality

[Killed] ConditionalExpression
src/sentry-init.ts:41:7
  */
 export function parseTracesSampleRate(raw: string | undefined): number {
   const n = Number(raw ?? DEFAULT_TRACES_SAMPLE_RATE);
-  if (!Number.isFinite(n) || n < 0 || n > 1) return DEFAULT_TRACES_SAMPLE_RATE;
+  if (true) return DEFAULT_TRACES_SAMPLE_RATE;
   return n;
 }
killedBy: parseTracesSampleRate accepts valid 0
statusReason: expected 0.1 to be +0 // Object.is equality

[Killed] BooleanLiteral
src/sentry-init.ts:58:7
  */
 export function buildSentryOptions(input: SentryInitInput): BuildSentryOptionsResult {
   const parsed = parseDsn(input.dsn);
-  if (!parsed.valid || parsed.dsn === undefined) {
+  if (parsed.valid || parsed.dsn === undefined) {
     return { options: null, skipReason: parsed.error ?? 'DSN invalid' };
   }
killedBy: buildSentryOptions returns full options for valid DSN
statusReason: expected null not to be null

[NoCoverage] StringLiteral
src/sentry-init.ts:59:57
 export function buildSentryOptions(input: SentryInitInput): BuildSentryOptionsResult {
   const parsed = parseDsn(input.dsn);
   if (!parsed.valid || parsed.dsn === undefined) {
-    return { options: null, skipReason: parsed.error ?? 'DSN invalid' };
+    return { options: null, skipReason: parsed.error ?? "" };
   }
   const options: SentryInitOptions = {
