[Killed] Regex
src/dsn.ts:8:19
 // whether a malformed DSN should fail-fast or skip Sentry init silently.
 import { z } from 'zod';
 
-const DSN_REGEX = /^https:\/\/[a-f0-9]+@[a-zA-Z0-9.-]+\/\d+$/;
+const DSN_REGEX = /^https:\/\/[a-f0-9]+@[a-zA-Z0-9.-]+\/\d+/;
 
 export const dsnSchema = z
killedBy: parseDsn anchor + error message tests (mutation hardening) rejects DSN with trailing garbage ($ anchor)
statusReason: expected true to be false // Object.is equality
