[Killed] StringLiteral
src/sentry-init.ts:79:23
   annotateEvent?: boolean;
 }
 
-const ENV_DEPTH_VAR = 'FLEET_SCRUB_DEPTH';
+const ENV_DEPTH_VAR = "";
 const MAX_ENV_DEPTH = 50;
 
killedBy: readDepthLimitFromEnv returns env value when valid number
statusReason: expected 6 to be 4 // Object.is equality

[Killed] EqualityOperator
src/sentry-init.ts:88:7
  */
 export function readDepthLimitFromEnv(env: Record<string, string | undefined>): number {
   const raw = env[ENV_DEPTH_VAR];
-  if (raw === undefined) return DEFAULT_DEPTH_LIMIT;
+  if (raw !== undefined) return DEFAULT_DEPTH_LIMIT;
   const n = Number(raw);
   if (!Number.isInteger(n) || n < 0 || n > MAX_ENV_DEPTH) return DEFAULT_DEPTH_LIMIT;
killedBy: readDepthLimitFromEnv returns env value when valid number
statusReason: expected 6 to be 4 // Object.is equality

[Killed] ConditionalExpression
src/sentry-init.ts:88:7
  */
 export function readDepthLimitFromEnv(env: Record<string, string | undefined>): number {
   const raw = env[ENV_DEPTH_VAR];
-  if (raw === undefined) return DEFAULT_DEPTH_LIMIT;
+  if (true) return DEFAULT_DEPTH_LIMIT;
   const n = Number(raw);
   if (!Number.isInteger(n) || n < 0 || n > MAX_ENV_DEPTH) return DEFAULT_DEPTH_LIMIT;
killedBy: readDepthLimitFromEnv returns env value when valid number
statusReason: expected 6 to be 4 // Object.is equality

[Killed] EqualityOperator
src/sentry-init.ts:90:31
   const raw = env[ENV_DEPTH_VAR];
   if (raw === undefined) return DEFAULT_DEPTH_LIMIT;
   const n = Number(raw);
-  if (!Number.isInteger(n) || n < 0 || n > MAX_ENV_DEPTH) return DEFAULT_DEPTH_LIMIT;
+  if (!Number.isInteger(n) || n <= 0 || n > MAX_ENV_DEPTH) return DEFAULT_DEPTH_LIMIT;
   return n;
 }
killedBy: readDepthLimitFromEnv accepts 0 as a valid depth (kills n < 0 → n <= 0 mutant)
statusReason: expected 6 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/sentry-init.ts:90:40
   const raw = env[ENV_DEPTH_VAR];
   if (raw === undefined) return DEFAULT_DEPTH_LIMIT;
   const n = Number(raw);
-  if (!Number.isInteger(n) || n < 0 || n > MAX_ENV_DEPTH) return DEFAULT_DEPTH_LIMIT;
+  if (!Number.isInteger(n) || n < 0 || false) return DEFAULT_DEPTH_LIMIT;
   return n;
 }
killedBy: readDepthLimitFromEnv returns DEFAULT_DEPTH_LIMIT when env value out of range
statusReason: expected 999 to be 6 // Object.is equality

[Killed] ConditionalExpression
src/sentry-init.ts:102:7
   options: CreateBeforeSendOptions = {},
 ): (event: ScrubbableEvent) => ScrubbableEvent {
   const { auditLog, annotateEvent } = options;
-  if (!auditLog && !annotateEvent) return scrubEvent;
+  if (true) return scrubEvent;
   return (event) => {
     let count = 0;
killedBy: createBeforeSend factory accepts auditLog option to track redaction counts
statusReason: expected [] to have a length of 1 but got +0

[Killed] BooleanLiteral
src/sentry-init.ts:102:7
   options: CreateBeforeSendOptions = {},
 ): (event: ScrubbableEvent) => ScrubbableEvent {
   const { auditLog, annotateEvent } = options;
-  if (!auditLog && !annotateEvent) return scrubEvent;
+  if (auditLog && !annotateEvent) return scrubEvent;
   return (event) => {
     let count = 0;
killedBy: createBeforeSend factory accepts auditLog option to track redaction counts
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/sentry-init.ts:105:54
   if (!auditLog && !annotateEvent) return scrubEvent;
   return (event) => {
     let count = 0;
-    const scrubFn = createScrubber({ onRedact: () => { count++; } });
+    const scrubFn = createScrubber({ onRedact: () => {} });
     const out = { ...event } as ScrubbableEvent;
     if (typeof out.message === 'string') {
killedBy: createBeforeSend factory accepts auditLog option to track redaction counts
statusReason: expected 1 to be greater than or equal to 2

[Killed] UpdateOperator
src/sentry-init.ts:105:56
   if (!auditLog && !annotateEvent) return scrubEvent;
   return (event) => {
     let count = 0;
-    const scrubFn = createScrubber({ onRedact: () => { count++; } });
+    const scrubFn = createScrubber({ onRedact: () => { count--; } });
     const out = { ...event } as ScrubbableEvent;
     if (typeof out.message === 'string') {
killedBy: createBeforeSend factory accepts auditLog option to track redaction counts
statusReason: expected 0 to be greater than or equal to 2

[Killed] BlockStatement
src/sentry-init.ts:107:42
     let count = 0;
     const scrubFn = createScrubber({ onRedact: () => { count++; } });
     const out = { ...event } as ScrubbableEvent;
-    if (typeof out.message === 'string') {
-      const before = out.message;
-      out.message = scrubString(out.message);
-      if (before !== out.message) count++;
-    }
+    if (typeof out.message === 'string') {}
     if (out.exception?.values) {
       out.exception = {
killedBy: createBeforeSend factory accepts auditLog option to track redaction counts
statusReason: expected 1 to be greater than or equal to 2

[Killed] ConditionalExpression
src/sentry-init.ts:110:11
     if (typeof out.message === 'string') {
       const before = out.message;
       out.message = scrubString(out.message);
-      if (before !== out.message) count++;
+      if (false) count++;
     }
     if (out.exception?.values) {
killedBy: createBeforeSend factory accepts auditLog option to track redaction counts
statusReason: expected 1 to be greater than or equal to 2

[Killed] ConditionalExpression
src/sentry-init.ts:110:11
     if (typeof out.message === 'string') {
       const before = out.message;
       out.message = scrubString(out.message);
-      if (before !== out.message) count++;
+      if (true) count++;
     }
     if (out.exception?.values) {
killedBy: createBeforeSend factory does not call auditLog when no redactions occur
statusReason: expected [ 1 ] to deeply equal [ +0 ]

[Killed] BlockStatement
src/sentry-init.ts:112:32
       out.message = scrubString(out.message);
       if (before !== out.message) count++;
     }
-    if (out.exception?.values) {
-      out.exception = {
-        ...out.exception,
-        values: out.exception.values.map((ex) => {
-          if (typeof ex.value !== 'string') return ex;
-          const before = ex.value;
-          const after = scrubString(ex.value);
-          if (before !== after) count++;
-          return { ...ex, value: after };
-        }),
-      };
-    }
+    if (out.exception?.values) {}
     if (out.request) {
       const req = { ...out.request };
killedBy: createBeforeSend full coverage paths counts redaction in exception.values strings
statusReason: expected 0 to be greater than or equal to 1

[Killed] ConditionalExpression
src/sentry-init.ts:119:15
           if (typeof ex.value !== 'string') return ex;
           const before = ex.value;
           const after = scrubString(ex.value);
-          if (before !== after) count++;
+          if (true) count++;
           return { ...ex, value: after };
         }),
killedBy: createBeforeSend full coverage paths skips non-string exception values
statusReason: expected [ 1 ] to deeply equal [ +0 ]

[Killed] UpdateOperator
src/sentry-init.ts:119:33
           if (typeof ex.value !== 'string') return ex;
           const before = ex.value;
           const after = scrubString(ex.value);
-          if (before !== after) count++;
+          if (before !== after) count--;
           return { ...ex, value: after };
         }),
killedBy: createBeforeSend full coverage paths counts redaction in exception.values strings
statusReason: expected -1 to be greater than or equal to 1

[Killed] ObjectLiteral
src/sentry-init.ts:120:18
           const before = ex.value;
           const after = scrubString(ex.value);
           if (before !== after) count++;
-          return { ...ex, value: after };
+          return {};
         }),
       };
killedBy: createBeforeSend mutation-hardening preserves other exception fields, not just value (kills L120 return-empty-object mutant)
statusReason: expected undefined to be '[redacted]' // Object.is equality

[Killed] BlockStatement
src/sentry-init.ts:124:22
         }),
       };
     }
-    if (out.request) {
-      const req = { ...out.request };
-      if (req.headers) {
-        const newHeaders: Record<string, string | string[]> = {};
-        for (const k of Object.keys(req.headers)) {
-          const v = req.headers[k];
-          if (v === undefined) continue;
-          if (PII_HEADERS.has(k.toLowerCase())) {
-            newHeaders[k] = Array.isArray(v) ? [REDACTED] : REDACTED;
-            count++;
-          } else {
-            newHeaders[k] = v;
-          }
-        }
-        req.headers = newHeaders;
-      }
-      if (req.data !== undefined) req.data = scrubFn(req.data);
-      out.request = req;
-    }
+    if (out.request) {}
     if (out.extra) out.extra = scrubFn(out.extra) as Record<string, unknown>;
     if (out.contexts) out.contexts = scrubFn(out.contexts) as Record<string, unknown>;
killedBy: createBeforeSend factory accepts auditLog option to track redaction counts
statusReason: expected 1 to be greater than or equal to 2

[Killed] ConditionalExpression
src/sentry-init.ts:124:9
         }),
       };
     }
-    if (out.request) {
+    if (true) {
       const req = { ...out.request };
       if (req.headers) {
killedBy: createBeforeSend mutation-hardening skips request handling when out.request is absent (kills L124 if(true) mutant)
statusReason: expected {} to be undefined

[Killed] BlockStatement
src/sentry-init.ts:126:24
     }
     if (out.request) {
       const req = { ...out.request };
-      if (req.headers) {
-        const newHeaders: Record<string, string | string[]> = {};
-        for (const k of Object.keys(req.headers)) {
-          const v = req.headers[k];
-          if (v === undefined) continue;
-          if (PII_HEADERS.has(k.toLowerCase())) {
-            newHeaders[k] = Array.isArray(v) ? [REDACTED] : REDACTED;
-            count++;
-          } else {
-            newHeaders[k] = v;
-          }
-        }
-        req.headers = newHeaders;
-      }
+      if (req.headers) {}
       if (req.data !== undefined) req.data = scrubFn(req.data);
       out.request = req;
killedBy: createBeforeSend full coverage paths counts redaction in request.headers (string and array)
statusReason: expected 0 to be greater than or equal to 2

[Killed] BlockStatement
src/sentry-init.ts:128:51
       const req = { ...out.request };
       if (req.headers) {
         const newHeaders: Record<string, string | string[]> = {};
-        for (const k of Object.keys(req.headers)) {
-          const v = req.headers[k];
-          if (v === undefined) continue;
-          if (PII_HEADERS.has(k.toLowerCase())) {
-            newHeaders[k] = Array.isArray(v) ? [REDACTED] : REDACTED;
-            count++;
-          } else {
-            newHeaders[k] = v;
-          }
-        }
+        for (const k of Object.keys(req.headers)) {}
         req.headers = newHeaders;
       }
killedBy: createBeforeSend full coverage paths counts redaction in request.headers (string and array)
statusReason: expected 0 to be greater than or equal to 2

[Killed] BlockStatement
src/sentry-init.ts:131:49
         for (const k of Object.keys(req.headers)) {
           const v = req.headers[k];
           if (v === undefined) continue;
-          if (PII_HEADERS.has(k.toLowerCase())) {
-            newHeaders[k] = Array.isArray(v) ? [REDACTED] : REDACTED;
-            count++;
-          } else {
+          if (PII_HEADERS.has(k.toLowerCase())) {} else {
             newHeaders[k] = v;
           }
killedBy: createBeforeSend full coverage paths counts redaction in request.headers (string and array)
statusReason: expected 0 to be greater than or equal to 2

[Killed] ConditionalExpression
src/sentry-init.ts:131:15
         for (const k of Object.keys(req.headers)) {
           const v = req.headers[k];
           if (v === undefined) continue;
-          if (PII_HEADERS.has(k.toLowerCase())) {
+          if (false) {
             newHeaders[k] = Array.isArray(v) ? [REDACTED] : REDACTED;
             count++;
killedBy: createBeforeSend full coverage paths counts redaction in request.headers (string and array)
statusReason: expected 0 to be greater than or equal to 2

[Killed] UpdateOperator
src/sentry-init.ts:133:13
           if (v === undefined) continue;
           if (PII_HEADERS.has(k.toLowerCase())) {
             newHeaders[k] = Array.isArray(v) ? [REDACTED] : REDACTED;
-            count++;
+            count--;
           } else {
             newHeaders[k] = v;
killedBy: createBeforeSend full coverage paths counts redaction in request.headers (string and array)
statusReason: expected -2 to be greater than or equal to 2

[Killed] BlockStatement
src/sentry-init.ts:134:18
           if (PII_HEADERS.has(k.toLowerCase())) {
             newHeaders[k] = Array.isArray(v) ? [REDACTED] : REDACTED;
             count++;
-          } else {
-            newHeaders[k] = v;
-          }
+          } else {}
         }
         req.headers = newHeaders;
killedBy: createBeforeSend mutation-hardening preserves non-PII header keys verbatim (kills L132 [REDACTED] -> [] mutant + L134 else block mutant)
statusReason: expected undefined to be 'trace-123' // Object.is equality

[Killed] EqualityOperator
src/sentry-init.ts:140:11
         }
         req.headers = newHeaders;
       }
-      if (req.data !== undefined) req.data = scrubFn(req.data);
+      if (req.data === undefined) req.data = scrubFn(req.data);
       out.request = req;
     }
killedBy: createBeforeSend factory accepts auditLog option to track redaction counts
statusReason: expected 1 to be greater than or equal to 2

[Killed] ConditionalExpression
src/sentry-init.ts:140:11
         }
         req.headers = newHeaders;
       }
-      if (req.data !== undefined) req.data = scrubFn(req.data);
+      if (false) req.data = scrubFn(req.data);
       out.request = req;
     }
killedBy: createBeforeSend factory accepts auditLog option to track redaction counts
statusReason: expected 1 to be greater than or equal to 2

[Killed] ConditionalExpression
src/sentry-init.ts:143:9
       if (req.data !== undefined) req.data = scrubFn(req.data);
       out.request = req;
     }
-    if (out.extra) out.extra = scrubFn(out.extra) as Record<string, unknown>;
+    if (false) out.extra = scrubFn(out.extra) as Record<string, unknown>;
     if (out.contexts) out.contexts = scrubFn(out.contexts) as Record<string, unknown>;
     if (annotateEvent) {
killedBy: createBeforeSend full coverage paths scrubs request.data, extra, contexts
statusReason: expected 't' to be '[redacted]' // Object.is equality

[Survived] ConditionalExpression
src/sentry-init.ts:143:9
       if (req.data !== undefined) req.data = scrubFn(req.data);
       out.request = req;
     }
-    if (out.extra) out.extra = scrubFn(out.extra) as Record<string, unknown>;
+    if (true) out.extra = scrubFn(out.extra) as Record<string, unknown>;
     if (out.contexts) out.contexts = scrubFn(out.contexts) as Record<string, unknown>;
     if (annotateEvent) {

[Survived] ConditionalExpression
src/sentry-init.ts:144:9
       out.request = req;
     }
     if (out.extra) out.extra = scrubFn(out.extra) as Record<string, unknown>;
-    if (out.contexts) out.contexts = scrubFn(out.contexts) as Record<string, unknown>;
+    if (false) out.contexts = scrubFn(out.contexts) as Record<string, unknown>;
     if (annotateEvent) {
       out.extra = { ...(out.extra ?? {}), __redaction: { count } };

[Survived] ConditionalExpression
src/sentry-init.ts:144:9
       out.request = req;
     }
     if (out.extra) out.extra = scrubFn(out.extra) as Record<string, unknown>;
-    if (out.contexts) out.contexts = scrubFn(out.contexts) as Record<string, unknown>;
+    if (true) out.contexts = scrubFn(out.contexts) as Record<string, unknown>;
     if (annotateEvent) {
       out.extra = { ...(out.extra ?? {}), __redaction: { count } };

[Killed] BlockStatement
src/sentry-init.ts:145:24
     }
     if (out.extra) out.extra = scrubFn(out.extra) as Record<string, unknown>;
     if (out.contexts) out.contexts = scrubFn(out.contexts) as Record<string, unknown>;
-    if (annotateEvent) {
-      out.extra = { ...(out.extra ?? {}), __redaction: { count } };
-    }
+    if (annotateEvent) {}
     auditLog?.(count);
     return out;
killedBy: createBeforeSend with audit metadata adds __redaction metadata to event.extra when annotateEvent is true
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/sentry-init.ts:145:9
     }
     if (out.extra) out.extra = scrubFn(out.extra) as Record<string, unknown>;
     if (out.contexts) out.contexts = scrubFn(out.contexts) as Record<string, unknown>;
-    if (annotateEvent) {
+    if (false) {
       out.extra = { ...(out.extra ?? {}), __redaction: { count } };
     }
killedBy: createBeforeSend with audit metadata adds __redaction metadata to event.extra when annotateEvent is true
statusReason: expected undefined to be defined

[Killed] LogicalOperator
src/sentry-init.ts:146:25
     if (out.extra) out.extra = scrubFn(out.extra) as Record<string, unknown>;
     if (out.contexts) out.contexts = scrubFn(out.contexts) as Record<string, unknown>;
     if (annotateEvent) {
-      out.extra = { ...(out.extra ?? {}), __redaction: { count } };
+      out.extra = { ...(out.extra && {}), __redaction: { count } };
     }
     auditLog?.(count);
killedBy: createBeforeSend full coverage paths annotateEvent merges into existing extra
statusReason: expected undefined to be 'keep' // Object.is equality
